In [2]:
import pandas as pd 
import matplotlib.pyplot as plt
import numpy as np

In [9]:
units = "common units.csv"
units_df = pd.read_csv(units, header=1)
units_df = units_df.drop(columns = ["Rental_Type","Date_Ready","Address_1","Zip_Code","Exclude","Unit_Type","Notes","Bldg_Code", "Available_Date", "Floor_Code", "Country", "Ref_Property_Id", "Ext_Ref_Unit_Id", "Ref_Building_Id", "Ref_Floor_Id", "Address_2","Address_3", "Address_4", "Location", 'Attributes_2', 'Attributes_3', 'Attributes_4', 'Attributes_5',
       'Attributes_6', 'Attributes_7', 'Attributes_8', 'Attributes_9',
       'Attributes_10', 'MLA', 'Lease_Type', 'Userdefined_1', 'Userdefined_2',
       'Userdefined_3', 'Userdefined_4', 'Userdefined_5', 'Userdefined_6',
       'Userdefined_7', 'Userdefined_8', 'Userdefined_9', 'Userdefined_10'])
units_df = units_df.rename(columns={"BedRooms": "Bedrooms","Attributes_1": "Bathrooms"})
units_df.head()

,Property_Code,Unit_Code,City,State,Rent,SQFT,Rent_Ready,Bedrooms,Bathrooms
0,ce,C0007A,Fairfield,OH,770,675,1,1,1.0
1,ce,C0007B,Fairfield,OH,770,675,1,1,1.0
2,ce,C0007C,Fairfield,OH,780,675,1,1,1.0
3,ce,C0007D,Fairfield,OH,780,675,1,1,1.0
4,ce,C0007E,Fairfield,OH,770,675,1,1,1.0

In [11]:
units_df.dtypes

Property_Code     object
Unit_Code         object
City              object
State             object
Rent               int64
SQFT               int64
Rent_Ready         int64
Bedrooms           int64
Bathrooms        float64
dtype: object

In [28]:
indexNames = units_df[units_df["Rent"]==0].index
units_df.drop(indexNames, inplace = True)
units_df.head()

,Property_Code,Unit_Code,City,State,Rent,SQFT,Rent_Ready,Bedrooms,Bathrooms
0,ce,C0007A,Fairfield,OH,770,675,1,1,1.0
1,ce,C0007B,Fairfield,OH,770,675,1,1,1.0
2,ce,C0007C,Fairfield,OH,780,675,1,1,1.0
3,ce,C0007D,Fairfield,OH,780,675,1,1,1.0
4,ce,C0007E,Fairfield,OH,770,675,1,1,1.0

In [26]:
max(units_df["Rent"])

1699

In [27]:
min(units_df["Rent"])

599

In [30]:
max(units_df["SQFT"])

1400

In [31]:
min(units_df["SQFT"])

387

In [33]:
units_count = units_df.groupby("Property_Code").count()
units_count

,Unit_Code,City,State,Rent,SQFT,Rent_Ready,Bedrooms,Bathrooms
Property_Code,,,,,,,,
ce,492,492,492,492,492,492,492,492
fh,408,408,408,408,408,408,408,402
mpg,354,354,354,354,354,354,354,344
sh,516,516,516,516,516,516,516,506

In [34]:
units_df.to_csv("units_final.csv")